Revit 2027 API
BuiltInFailures.ElectricalFailures.ConduitModified Property
 The conduit has been modified to be in the opposite direction or insufficient space to create the required fittings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ConduitModified { get; }
Public Shared ReadOnly Property ConduitModified As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ConduitModified {
	FailureDefinitionId^ get ();
}
static member ConduitModified : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace